## Series in Pandas

In [2]:
import numpy as np
import pandas as pd

In [10]:
label = ['a','b','c']
my_data = [10,9,8]
arr = np.array(my_data)
d= {'a':10,'b':9,'c':8} 

print('arr = ',arr)
print('d = ',d)

arr =  [10  9  8]
d =  {'a': 10, 'b': 9, 'c': 8}

In [4]:
pd.Series(data = my_data)

0    10
1     9
2     8
dtype: int64

In [5]:
pd.Series(data = my_data, index=label)

a    10
b     9
c     8
dtype: int64

In [11]:
# Another way to write the upper statment
pd.Series(my_data,label)

a    10
b     9
c     8
dtype: int64

In [13]:
# Another way to write 
pd.Series(arr,label)

a    10
b     9
c     8
dtype: int64

In [14]:
# Another way to write

pd.Series(d)

a    10
b     9
c     8
dtype: int64

In [17]:
pd.Series(data=[sum,print,len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [18]:
ser1 = pd.Series([1,2,3,4],['USA','Germany', 'USSR','Japan'])

In [19]:
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [20]:
ser2 = pd.Series([1,2,5,4],['USA','Germany', 'Itly','Japan'])

In [21]:
ser2

USA        1
Germany    2
Itly       5
Japan      4
dtype: int64

In [22]:
# Showing index
ser1['USA']

1

In [24]:
ser3 = pd.Series(data=label)

In [26]:
ser3

0    a
1    b
2    c
dtype: object

In [27]:
ser3[0]

'a'

In [28]:
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [29]:
ser2

USA        1
Germany    2
Itly       5
Japan      4
dtype: int64

In [32]:
ser1 + ser2

Germany    4.0
Itly       NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

## Data Frame

In [38]:
from numpy.random import randn

In [39]:
np.random.seed(101) # seed fuction ensures the same random number

In [40]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z']) 
# pd.Dataframe(values that are generated(rows,colums), row title, column title)

In [41]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [43]:
df['W'] # grabbing the column (prefered)

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [44]:
type(df)

pandas.core.frame.DataFrame

In [46]:
# Another way to grab column 
df.W

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [48]:
# Multile column grabbing 

df[['W','Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [49]:
# Creating the new column in a table
df['new'] = df['W']+df['Y']

In [50]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [52]:
# For droping a column, axis =1 if to drop column and axis=0 if to drop row
df.drop('new',axis=1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [53]:
#df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [54]:
# To remove permanently we use inplace 
df.drop('new',axis=1,inplace=True)

In [55]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [56]:
df.shape

(5, 4)

In [58]:
## Selecting rows

df.loc['C']

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [59]:
# Second way to grab the row (index base location)

df.iloc[2]

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [60]:
# Selecting subset from the table 
df.loc['B','Y']

-0.8480769834036315

In [61]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

In [62]:
df > 0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [64]:
booldf = df > 0

df[booldf]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [65]:
df[df>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [66]:
# only show data in W> 0

df['W']> 0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [67]:
# only show data where W>0
df[df['W']>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [71]:
df[df['W']>0][['X','Y']]

          X         Y
A  0.628133  0.907969
B -0.319318 -0.848077
D -0.758872 -0.933237
E  1.978757  2.605967

In [75]:
df[(df['W']>0) & (df['Y']>1)] # and != &

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [74]:
True and True

True

In [76]:
df[(df['W']>0) | (df['Y']>1)] # or !=  |

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [77]:
df.reset_index() #use implace for Permanent results

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [78]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [79]:
newinde = 'CA NY WY OR CO'.split() # Split the data on space

In [80]:
newinde

['CA', 'NY', 'WY', 'OR', 'CO']

In [81]:
df['States'] = newinde

In [82]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [84]:
df.set_index('States') # for permanent use inplace

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

# Multilevel index

In [86]:
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hire_index = list(zip(outside,inside))
hire_index = pd.MultiIndex.from_tuples(hire_index)

In [87]:
outside

['G1', 'G1', 'G1', 'G2', 'G2', 'G2']

In [88]:
inside

[1, 2, 3, 1, 2, 3]

In [89]:
hire_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [90]:
df = pd.DataFrame(randn(6,2), hire_index,['A','B'])

In [91]:
df

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

In [92]:
df.loc['G1']

          A         B
1  0.302665  1.693723
2 -1.706086 -1.159119
3 -0.134841  0.390528

In [93]:
df.loc['G1'].loc[1]

A    0.302665
B    1.693723
Name: 1, dtype: float64

In [94]:
df.index.names

FrozenList([None, None])

In [96]:
df.index.names=['Groups','Num']

In [97]:
df

                   A         B
Groups Num
G1     1    0.302665  1.693723
       2   -1.706086 -1.159119
       3   -0.134841  0.390528
G2     1    0.166905  0.184502
       2    0.807706  0.072960
       3    0.638787  0.329646

In [98]:
df.loc['G2'].loc[2]['B']

0.07295967531703869

In [100]:
df.loc['G1'].loc[3]['A']

-0.13484072060601238

In [101]:
df.xs('G1')

            A         B
Num
1    0.302665  1.693723
2   -1.706086 -1.159119
3   -0.134841  0.390528

In [102]:
# inside level =1 
df.xs(1,level='Num')

               A         B
Groups
G1      0.302665  1.693723
G2      0.166905  0.184502

## Missing Data

In [103]:
d = {'A':[1,2,np.nan],'B':[5,np.nan, np.nan],'C':[1,2,3] }
df = pd.DataFrame(d)

In [104]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [105]:
 df.dropna()

     A    B  C
0  1.0  5.0  1

In [107]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [108]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [109]:
df.fillna(value='Fill Value')

            A           B  C
0         1.0         5.0  1
1         2.0  Fill Value  2
2  Fill Value  Fill Value  3

In [110]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [111]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

## Group by

In [113]:
# dictionary 
data = {'Company':['Google','Google','Microsoft','Microsoft','Facebook','Facebook'],
        'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],'Sales':[200,120,340,124,243,350]}

In [114]:
df = pd.DataFrame(data)

In [115]:
df

     Company   Person  Sales
0     Google      Sam    200
1     Google  Charlie    120
2  Microsoft      Amy    340
3  Microsoft  Vanessa    124
4   Facebook     Carl    243
5   Facebook    Sarah    350

In [116]:
df.groupby('Company')

In [117]:
byCompany = df.groupby('Company')

In [119]:
byCompany.mean()

           Sales
Company
Facebook   296.5
Google     160.0
Microsoft  232.0

In [120]:
byCompany.sum()

           Sales
Company
Facebook     593
Google       320
Microsoft    464

In [121]:
byCompany.std()

                Sales
Company
Facebook    75.660426
Google      56.568542
Microsoft  152.735065

In [122]:
byCompany.std().loc['Facebook']

Sales    75.660426
Name: Facebook, dtype: float64

In [123]:
df.groupby('Company').max()

            Person  Sales
Company
Facebook     Sarah    350
Google         Sam    200
Microsoft  Vanessa    340

In [125]:
df.groupby('Company').describe()

          Sales
          count   mean         std    min     25%    50%     75%    max
Company
Facebook    2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
Google      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
Microsoft   2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [127]:
df.groupby('Company').describe().transpose()['Facebook']

Sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: Facebook, dtype: float64

## Merging, Joining and Concatenating